laptops = [
    {
        'название': "Компуктер",
        "ОЗУ": 4,
        "жесткий диск": 256,
        "тип памяти": "HDD",
        'процессор': "жужжалка",
        'порты': ['USB 2.0', 'USB 3.0', 'HDMI'],
        'цена': 10000,
        'описание': ''
    },
    {
        'название': "Калькулятор",
        "ОЗУ": 2,
        "жесткий диск": 96,
        "тип памяти": "HDD",
        'процессор': "тупик",
        'порты': ['USB 2.0', "COM"],
        'цена': 6000,
        'описание': ''
    },
    {
        'название': "Исчислятор",
        "ОЗУ": 16,
        "жесткий диск": 516,
        "тип памяти": "SSD",
        'процессор': "спринтер",
        'порты': ['USB 2.0', 'USB 3.0', 'USB 3.0', 'HDMI', 'XLC'],
        'цена': 15000,
        'описание': ''
    },
    {
        'название': "Рабочий",
        "ОЗУ": 4,
        "жесткий диск": 1024,
        "тип памяти": "HDD",
        'процессор': "жужжалка",
        'порты': ['USB 2.0', 'USB 3.0', 'XLC'],
        'цена': 12000,
        'описание': ''
    },
    {
        'название': "УльтраГеймер",
        "ОЗУ": 32,
        "жесткий диск": 1024,
        "тип памяти": "SSD",
        'процессор': "спринтер",
        'порты': ['USB 3.0', 'USB 3.0', 'HDMI'],
        'цена': 40000,
        'описание': ''
    },
]


# вывести название и стоимость самого дорогого ноутбука
max_price = 0
max_name = ''
for laptop in laptops:
    if laptop['цена'] > max_price:
        max_price = laptop['цена']
        max_name = laptop['название']

print(max_price)
print(max_name)
