laptops = [
    {
        'название': "Компуктер",
        "ОЗУ": 4,
        "жесткий диск": 256,
        "тип памяти": "HDD",
        'процессор': "жужжалка",
        'порты': ['USB 2.0', 'USB 3.0', 'HDMI'],
        'цена': 10000,
        'описание': ''
    },
    {
        'название': "Калькулятор",
        "ОЗУ": 2,
        "жесткий диск": 96,
        "тип памяти": "HDD",
        'процессор': "тупик",
        'порты': ['USB 2.0', "COM"],
        'цена': 6000,
        'описание': ''
    },
    {
        'название': "Исчислятор",
        "ОЗУ": 16,
        "жесткий диск": 516,
        "тип памяти": "SSD",
        'процессор': "спринтер",
        'порты': ['USB 2.0', 'USB 3.0', 'USB 3.0', 'HDMI', 'XLC'],
        'цена': 15000,
        'описание': ''
    },
    {
        'название': "Рабочий",
        "ОЗУ": 4,
        "жесткий диск": 1024,
        "тип памяти": "HDD",
        'процессор': "жужжалка",
        'порты': ['USB 2.0', 'USB 3.0', 'XLC'],
        'цена': 12000,
        'описание': ''
    },
    {
        'название': "УльтраГеймер",
        "ОЗУ": 32,
        "жесткий диск": 1024,
        "тип памяти": "SSD",
        'процессор': "спринтер",
        'порты': ['USB 3.0', 'USB 3.0', 'HDMI'],
        'цена': 40000,
        'описание': ''
    },
]


# найти самый частовстречающийся порт

# считаем количество каждого порта (храним эту инфу в словаре)
ports_counts = {}
for laptop in laptops:
    for port in laptop['порты']:  # USB 3.0
        if port in ports_counts:
            ports_counts[port] += 1
        else:
            ports_counts[port] = 1


# ищем максимум среди количеств портов по вышесозданному словарю
cur_max = 0
max_port = ''
for port, count in ports_counts.items():
    if count > cur_max:
        cur_max = count
        max_port = port

print(f'Самый популярный порт - {max_port}. (Встречается {cur_max} раз)')
