"""
Вывести матрицу на экран (красиво, построчно)
"""
matrix = [
    [1, 5, 3, 6],
    [7, '3', 6, 1],
    [4, 7, '8', 5]
]

# вывод матрицы на экран
for row in matrix:  # [7, '3', 6, 1]
    text = '|'
    for el in row:
        text += str(el) + ' '
    print(text[:-1] + '|')

