"""
Пользователь вводит номер ряда.
Программа должна вывести все элементы ряда.
Каждый в новой строке.
"""

matrix = [
    [1, 5, 3, 6, 5],
    [7, 3, 6, 1, 1],
    [4, 7, 8, 5, 1],
]
i = int(input('Номер ряда: '))
j = 0
while j < len(matrix[0]):
    print('i=', i, '; j=', j, '  ', matrix[i][j])
    j += 1
