def struct_summer(value):
    """
    [1, [3, 2, [[1, [4, 2, [1], [], 6], 5], [1, 2, [1, 2, [1]], [1]]], [6, 4, [2]]]]  -> 45

    f([1, [[5, 2]], [5, [2, []]]]) -> f(1) + f([[[5, 2]], [5, [2, []]]]) ->
    -> 1 + f([[[5, 2]], [5, [2, []]]]) -> 1 + f([[5, 2]]) + f([[5, [2, []]]])

    f([[5, 2]]) -> f([5, 2]) + f([]) -> f([5, 2]) + 0 -> f(5) + f([2]) + 0 -> 5 + f(2) + f([]) + 0 ->
    -> 5 + 2 + 0 + 0 -> 7

    Точки остановки:
    ! когда инт, возвращаем инт
    ! когда пустой лист, возвращаем 0

    f(struct) = f(struct[0]) + f(struct[1:])
    """
    if type(value) is int:
        return value
    if len(value) == 0:
        return 0

    return struct_summer(value[0]) + struct_summer(value[1:])


print(struct_summer([1, [3, 2, [[1, [4, 2, [1], [], 6], 5], [1, 2, [1, 2, [1]], [1]]], [6, 4, [2]]]]))
